Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 126, 42, 32)       320       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 63, 21, 32)        0         
_________________________________________________________________
flatten (Flatten)            (None, 42336)             0         
_________________________________________________________________
dense (Dense)                (None, 3)                 127011    
=================================================================
Total params: 127,331
Trainable params: 127,331
Non-trainable params: 0
_________________________________________________________________
