Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 126, 42, 32)       320       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 124, 40, 32)       9248      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 62, 20, 32)        0         
_________________________________________________________________
dropout (Dropout)            (None, 62, 20, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 60, 18, 64)        18496     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 58, 16, 64)        36928     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 29, 8, 64)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 29, 8, 64)         0         
_________________________________________________________________
flatten (Flatten)            (None, 14848)             0         
_________________________________________________________________
dense (Dense)                (None, 512)               7602688   
_________________________________________________________________
dropout_2 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 3)                 1539      
=================================================================
Total params: 7,669,219
Trainable params: 7,669,219
Non-trainable params: 0
_________________________________________________________________
