Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 16)                3904      
_________________________________________________________________
dense (Dense)                (None, 1)                 17        
_________________________________________________________________
dense_1 (Dense)              (None, 3)                 6         
=================================================================
Total params: 3,927
Trainable params: 3,927
Non-trainable params: 0
_________________________________________________________________
