Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 42, 32)            384       
_________________________________________________________________
dropout (Dropout)            (None, 42, 32)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 42, 3)             99        
=================================================================
Total params: 483
Trainable params: 483
Non-trainable params: 0
_________________________________________________________________
